# CHAPTER 7
## Data Cleaning and Preparation

# 7.1 Handling Missing Data

In [1]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [2]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

# Filtering Out Missing Data

In [6]:
from numpy import nan as NA

In [7]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
 ....:              [NA, NA, NA], [NA, 6.5, 3.]])

In [10]:
cleaned = data.dropna()

In [11]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = NA

In [15]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [18]:
df

          0         1         2
0 -1.221109       NaN       NaN
1 -0.518797       NaN       NaN
2  0.437692       NaN -1.972701
3 -0.083984       NaN -0.672961
4 -0.018719 -0.150162  1.062127
5  0.944242  2.433628  0.192754
6 -0.457477  1.366815  1.731321

In [19]:
df.dropna()

          0         1         2
4 -0.018719 -0.150162  1.062127
5  0.944242  2.433628  0.192754
6 -0.457477  1.366815  1.731321

In [20]:
df.dropna(thresh=2)

          0         1         2
2  0.437692       NaN -1.972701
3 -0.083984       NaN -0.672961
4 -0.018719 -0.150162  1.062127
5  0.944242  2.433628  0.192754
6 -0.457477  1.366815  1.731321

# Filling In Missing Data

In [21]:
df.fillna(0)

          0         1         2
0 -1.221109  0.000000  0.000000
1 -0.518797  0.000000  0.000000
2  0.437692  0.000000 -1.972701
3 -0.083984  0.000000 -0.672961
4 -0.018719 -0.150162  1.062127
5  0.944242  2.433628  0.192754
6 -0.457477  1.366815  1.731321

In [22]:
 df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.221109  0.500000  0.000000
1 -0.518797  0.500000  0.000000
2  0.437692  0.500000 -1.972701
3 -0.083984  0.500000 -0.672961
4 -0.018719 -0.150162  1.062127
5  0.944242  2.433628  0.192754
6 -0.457477  1.366815  1.731321

In [23]:
 _ = df.fillna(0, inplace=True)

In [24]:
df

          0         1         2
0 -1.221109  0.000000  0.000000
1 -0.518797  0.000000  0.000000
2  0.437692  0.000000 -1.972701
3 -0.083984  0.000000 -0.672961
4 -0.018719 -0.150162  1.062127
5  0.944242  2.433628  0.192754
6 -0.457477  1.366815  1.731321

In [25]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [26]:
df

          0         1         2
0 -1.216206 -1.197381 -0.524900
1 -0.002729  0.259173 -0.133632
2 -0.350356       NaN -0.639643
3  0.027805       NaN  1.532910
4 -0.911402       NaN       NaN
5  0.823421       NaN       NaN

In [27]:
df.fillna(method='ffill')

          0         1         2
0 -1.216206 -1.197381 -0.524900
1 -0.002729  0.259173 -0.133632
2 -0.350356  0.259173 -0.639643
3  0.027805  0.259173  1.532910
4 -0.911402  0.259173  1.532910
5  0.823421  0.259173  1.532910

In [28]:
 df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.216206 -1.197381 -0.524900
1 -0.002729  0.259173 -0.133632
2 -0.350356  0.259173 -0.639643
3  0.027805  0.259173  1.532910
4 -0.911402       NaN  1.532910
5  0.823421       NaN  1.532910

In [29]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 Data Transformation
## Removing Duplicates

In [30]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
 ....:              'k2': [1, 1, 2, 3, 3, 4, 4]})

In [31]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [32]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [33]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [34]:
data['v1'] = range(7)

In [35]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [36]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

# Transforming Data Using a Function or Mapping

In [37]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
 ....:                      'Pastrami', 'corned beef', 'Bacon',
 ....:                      'pastrami', 'honey ham', 'nova lox'],
 ....:                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [38]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [39]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [40]:
lowercased = data['food'].str.lower()

In [41]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [42]:
data['animal'] = lowercased.map(meat_to_animal)

In [43]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

# Replacing Values

In [45]:
data1 = pd.Series([1., -999., 2., -999., -1000., 3.])
data1

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [46]:
data1.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [47]:
data1.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [48]:
data1.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [49]:
data1.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Renaming Axis Indexes

In [50]:
data2 = pd.DataFrame(np.arange(12).reshape((3, 4)),
 ....: index=['Ohio', 'Colorado', 'New York'],
 ....: columns=['one', 'two', 'three', 'four'])

In [51]:
transform = lambda x: x[:4].upper()

In [52]:
data2.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [53]:
data2.index = data2.index.map(transform)
data2

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [54]:
data2.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [55]:
data2.rename(index={'OHIO': 'INDIANA'},
 ....: columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [56]:
data2.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data2

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

# Discretization and Binning

In [57]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [58]:
bins = [18, 25, 35, 60, 100]

In [59]:
cats = pd.cut(ages, bins)

In [60]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [61]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [62]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [63]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [64]:
 pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [65]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [66]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [67]:
a = pd.cut(ages, bins, labels=group_names)

In [68]:
df1 = pd.DataFrame(a)

In [69]:
df1

             0
0        Youth
1        Youth
2        Youth
3   YoungAdult
4        Youth
5        Youth
6   MiddleAged
7   YoungAdult
8       Senior
9   MiddleAged
10  MiddleAged
11  YoungAdult

In [70]:
data3 = np.random.rand(20)
pd.cut(data3, 4, precision=2)

[(0.25, 0.45], (0.65, 0.85], (0.25, 0.45], (0.25, 0.45], (0.45, 0.65], ..., (0.45, 0.65], (0.25, 0.45], (0.05, 0.25], (0.25, 0.45], (0.05, 0.25]]
Length: 20
Categories (4, interval[float64]): [(0.05, 0.25] < (0.25, 0.45] < (0.45, 0.65] < (0.65, 0.85]]

In [71]:
data = np.random.randn(1000)     # Normally distributed
cats = pd.qcut(data, 4)          # Cut into quartiles
cats

[(-0.664, 0.0319], (-0.664, 0.0319], (0.0319, 0.702], (0.0319, 0.702], (-0.664, 0.0319], ..., (-3.118, -0.664], (-0.664, 0.0319], (0.0319, 0.702], (-3.118, -0.664], (0.0319, 0.702]]
Length: 1000
Categories (4, interval[float64]): [(-3.118, -0.664] < (-0.664, 0.0319] < (0.0319, 0.702] < (0.702, 3.206]]

In [72]:
pd.value_counts(cats)

(0.702, 3.206]      250
(0.0319, 0.702]     250
(-0.664, 0.0319]    250
(-3.118, -0.664]    250
dtype: int64

In [73]:
b = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

In [74]:
pd.value_counts(b)

(0.0319, 1.337]     400
(-1.253, 0.0319]    400
(1.337, 3.206]      100
(-3.118, -1.253]    100
dtype: int64

# Detecting and Filtering Outliers

In [75]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.028967     0.002325     0.046322    -0.016768
std       1.017128     1.022264     0.973704     1.010410
min      -3.490917    -2.860718    -3.491090    -3.016139
25%      -0.659904    -0.716281    -0.598776    -0.671469
50%       0.016339    -0.017775     0.043642    -0.035589
75%       0.741248     0.676594     0.695636     0.655315
max       3.199894     3.454025     2.900198     3.697122

In [76]:
# data

In [77]:
col = data[2]
col[np.abs(col) > 3]

44    -3.273190
472   -3.201475
866   -3.491090
Name: 2, dtype: float64

In [78]:
# col

In [79]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
15  -0.432041  0.575399 -1.694090 -3.016139
44  -0.742555 -0.287582 -3.273190  0.476627
51  -3.490917  0.545130  0.151650 -0.270257
154  3.025298  0.577511 -0.865094  1.400311
196  0.449057  0.079092  0.648146  3.697122
198 -0.929855  3.454025 -0.117639  0.211519
324  3.199894 -0.776848  1.341659  1.378604
370  0.757096  0.699620  0.738177  3.214555
472 -0.538308 -0.096070 -3.201475  0.879258
484  3.036760  1.673624  0.262713 -0.036954
495 -0.618266 -0.112102 -0.107171  3.118420
866 -0.873976  0.719412 -3.491090  1.042863

In [80]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.029196     0.001871     0.047288    -0.017782
std       1.014756     1.020829     0.970490     1.007007
min      -3.000000    -2.860718    -3.000000    -3.000000
25%      -0.659904    -0.716281    -0.598776    -0.671469
50%       0.016339    -0.017775     0.043642    -0.035589
75%       0.741248     0.676594     0.695636     0.655315
max       3.000000     3.000000     2.900198     3.000000

In [81]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0 -1.0 -1.0  1.0
3  1.0  1.0 -1.0  1.0
4  1.0 -1.0  1.0 -1.0

# Permutation and Random Sampling

In [82]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)

In [83]:
sampler

array([2, 4, 1, 3, 0])

In [84]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [85]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3

In [87]:
df.sample(n = 3)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3

In [88]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

3    6
3    6
2   -1
4    4
3    6
1    7
3    6
3    6
1    7
1    7
dtype: int64

# Computing Indicator/Dummy Variables

In [90]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
 .....:            'data1': range(6)})

In [91]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [92]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [93]:
df_with_dummy = df[['data1']].join(dummies)

In [94]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [95]:
mnames = ["movie_id", "title", "genres"]

In [101]:
# ?

# 7.3 String Manipulation
## String Object Methods

In [102]:
val = 'a,b, guido'

In [110]:
A = val.split(',')

In [111]:
A

['a', 'b', ' guido']

In [104]:
pieces = [x.strip() for x in val.split(',')]

In [105]:
pieces

['a', 'b', 'guido']

In [106]:
first, second, third = pieces

In [108]:
first + '::' + second + '::' + third

'a::b::guido'

In [109]:
'::'.join(pieces)

'a::b::guido'

In [112]:
'::'.join(A)

'a::b:: guido'

In [113]:
'guido' in val

True

In [114]:
val.index(',')

1

In [115]:
val.find(':')

-1

In [116]:
val.count(',')

2

In [117]:
val.replace(',', '::')

'a::b:: guido'

In [118]:
val.replace(',', '')

'ab guido'

# Regular Expressions

In [121]:
import re

In [122]:
text = "foo bar\t baz \tqux"

In [123]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [127]:
regex = re.compile('\s+')
# regex

In [125]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [128]:
regex.findall(text)

[' ', '\t ', ' \t']

In [129]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [130]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [131]:
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [132]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [133]:
m = regex.search(text)

In [134]:
m

In [136]:
text[m.start():m.end()]

'dave@google.com'

In [137]:
print(regex.match(text))

None

In [138]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [139]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [140]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [141]:
m = regex.match('wesm@bright.net')

In [142]:
m.groups()

('wesm', 'bright', 'net')

In [143]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [146]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

# Vectorized String Functions in pandas

In [147]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
 .....:                 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [148]:
data = pd.Series(data)

In [149]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [150]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [151]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [152]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [153]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [155]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [156]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [160]:
# matches.str.get(1)

In [162]:
# matches.str[0]

In [163]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object